Revit 2026 API

# ConduitSize Class

---

Stores the basic size information for a conduit.

SystemObject Autodesk.Revit.DB.ElectricalConduitSize

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConduitSize : IDisposable
```
```vb
Public Class ConduitSize
	Implements IDisposable
```
```cpp
public ref class ConduitSize : IDisposable
```
```fsharp
type ConduitSize =
    class
        interface IDisposable
    end
```

The ConduitSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConduitSize | Constructs an object that stores the basic size information for conduit. |

|  | Name | Description |
| --- | --- | --- |
|  | BendRadius | Minimum bend radius |
|  | InnerDiameter | Inner diameter |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NominalDiameter | Nominal diameter |
|  | OuterDiameter | Outer diameter |
|  | UsedInSizeLists | Whether it is used in size lists. |
|  | UsedInSizing | Whether is used in sizing. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ConduitSize |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace